---
kind: type
id: T:Autodesk.Revit.DB.FamilyType
source: html/7f15b213-c99b-db59-3622-3280757b82d9.htm
---
# Autodesk.Revit.DB.FamilyType

The family type object provides read access to the values of family parameters for this type.

## Syntax (C#)
```csharp
public class FamilyType : APIObject
```